In [20]:
import pandas as pd
df = pd.read_excel('Athletes.xlsx')
df

                        Name      NOC           Discipline
0            AALERUD Katrine   Norway         Cycling Road
1                ABAD Nestor    Spain  Artistic Gymnastics
2          ABAGNALE Giovanni    Italy               Rowing
3             ABALDE Alberto    Spain           Basketball
4              ABALDE Tamara    Spain           Basketball
...                      ...      ...                  ...
11080  ZWICKER Martin Detlef  Germany               Hockey
11081      ZWOLINSKA Klaudia   Poland         Canoe Slalom
11082           ZYKOVA Yulia      ROC             Shooting
11083      ZYUZINA Ekaterina      ROC              Sailing
11084        ZYZANSKA Sylwia   Poland              Archery

[11085 rows x 3 columns]

In [22]:
df = (
    df.groupby('Discipline', as_index=False).count()
    .sort_values('Name', ascending=False)
    .reset_index()
    .drop(['Name', 'index'], axis=1)
    .head(6)
)
df

  Discipline   NOC
0  Athletics  2068
1   Swimming   743
2   Football   567
3     Rowing   496
4     Hockey   406
5       Judo   373

In [24]:


discipline = df.Discipline.to_list()
noc = df.NOC.to_list()

In [25]:
val = []
for d, n in zip(discipline,noc):
      val.append({"category": d, "amount": n/100})

In [27]:
import json
with open('demo.json', 'w') as f:
    f.write(json.dumps(val))